In [1]:
import pandas as pd

In [2]:
loan_df = pd.read_csv('data/loan.csv')
loan_df

,loan_id,married_or_not,self_employed_or_not,applicant_income,loan_amount,property_area,loan_status
0,LP1003,Y,N,4583,128.4,Rural,N
1,LP1005,Y,Y,3000,66.0,City,Y
2,LP1006,Y,N,2583,120.5,City,Y
3,LP1008,N,N,6000,141.4,City,Y
4,LP1011,Y,Y,5417,267.4,City,Y
...,...,...,...,...,...,...,...
595,LP2974,Y,N,3232,108.6,Rural,Y
596,LP2979,Y,N,4106,40.7,Rural,Y
597,LP2983,Y,N,8072,253.4,City,Y
598,LP2984,Y,N,7583,187.6,City,Y
599,LP2990,N,Y,4583,133.2,Suburb,N

In [3]:
loan_df = loan_df.set_index('loan_id')

In [4]:
loan_df.columns = ['married', 'self_employed', 'income', 'amount', 'property_area', 'loan_status']

In [5]:
loan_df

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1006        Y             N    2583   120.5          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
...         ...           ...     ...     ...           ...         ...
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y
LP2990        N             Y    4583   133.2        Suburb           N

[600 rows x 6 columns]

In [6]:
loan_df['amount']

loan_id
LP1003    128.4
LP1005     66.0
LP1006    120.5
LP1008    141.4
LP1011    267.4
          ...
LP2974    108.6
LP2979     40.7
LP2983    253.4
LP2984    187.6
LP2990    133.2
Name: amount, Length: 600, dtype: float64

In [7]:
loan_df['amount'].dtype

dtype('float64')

In [8]:
loan_df['amount'].describe()

count    589.000000
mean     146.971307
std       85.756442
min        9.200000
25%      100.700000
50%      128.000000
75%      168.300000
max      700.300000
Name: amount, dtype: float64

In [9]:
loan_df['self_employed'].dtype

dtype('O')

In [10]:
loan_df['self_employed'].describe()

count     568
unique      2
top         N
freq      488
Name: self_employed, dtype: object

In [11]:
loan_df['self_employed'].unique()

array(['N', 'Y', nan], dtype=object)

In [12]:
loan_df['self_employed'].value_counts()

self_employed
N    488
Y     80
Name: count, dtype: int64

In [13]:
loan_df['self_employed'].value_counts(dropna=False)

self_employed
N      488
Y       80
NaN     32
Name: count, dtype: int64

In [14]:
loan_df['self_employed'].value_counts(dropna=False, normalize=True)

self_employed
N      0.813333
Y      0.133333
NaN    0.053333
Name: proportion, dtype: float64

In [15]:
loan_df[['amount', 'income']]

         amount  income
loan_id
LP1003    128.4    4583
LP1005     66.0    3000
LP1006    120.5    2583
LP1008    141.4    6000
LP1011    267.4    5417
...         ...     ...
LP2974    108.6    3232
LP2979     40.7    4106
LP2983    253.4    8072
LP2984    187.6    7583
LP2990    133.2    4583

[600 rows x 2 columns]

In [16]:
loan_df[['amount']]

         amount
loan_id
LP1003    128.4
LP1005     66.0
LP1006    120.5
LP1008    141.4
LP1011    267.4
...         ...
LP2974    108.6
LP2979     40.7
LP2983    253.4
LP2984    187.6
LP2990    133.2

[600 rows x 1 columns]

In [17]:
loan_df['amount']

loan_id
LP1003    128.4
LP1005     66.0
LP1006    120.5
LP1008    141.4
LP1011    267.4
          ...
LP2974    108.6
LP2979     40.7
LP2983    253.4
LP2984    187.6
LP2990    133.2
Name: amount, Length: 600, dtype: float64

In [19]:
loan_df['amount'].unique()

array([128.4,  66. , 120.5, 141.4, 267.4,  95.3, 158.2, 168.6, 349.3,
        70.3, 109.6, 200.5, 114.1,  17.5, 125.2, 100.8,  76.9, 133.5,
       115.8, 104.1, 315.5, 116.1, 112.4, 151.1, 191.1, 122.6, 110.2,
        35.1, 120.2, 201.3,  74.5, 106.2, 114.6, 320.5, 100.5, 144.4,
       184.8, 110.6,  80.2,  47.7,  76. , 134.5,  96.9,  88.3,  44.6,
       120.4, 144.8, 121. , 112.5, 134.1, 286.4,  97.9,  96.4, 135. ,
       180.2, 144.1, 100. , 165.8,   nan, 116.8, 258.2, 126.3, 312.5,
       125.4, 136. , 173. ,  97.4,  81.5, 187.3, 113.4, 176.8, 110.7,
       180.4, 130. , 111.8, 167.3, 265.6,  50. , 136.7,  99.4, 104.5,
       210.4, 175.4, 131.6, 189. ,  81.1, 122.3,  25. , 137.7,  50.2,
       115.4, 133.7, 151.2, 100.9, 225.8, 120.1, 216.9,  94.7, 136.8,
       139.5, 152.2, 118.9, 185.6, 154.3,  85.3, 175.9, 259.4, 180.5,
       137.8,  81.6, 194.2,  93.6, 370.5, 160.5, 182.7, 650.2,  74.2,
        70.1,  25.3, 102. , 290.6,  84.3,  88.2, 242.1, 129.3, 185.2,
       168.3, 175.5, 122.5, 187.8, 101. ,  70. ,  30.2, 225.6, 244.7,
       113.7,  50.8, 600. , 160.2, 187.7, 255. ,  98.4, 275.6, 121.1,
       158.1,  75. , 182.4, 112.7, 129.2,  63.9, 200.4,  95.6, 700.3,
       188. ,  87.4, 116.2, 101.4, 495.4, 116.5, 102.5, 180. ,  67.2,
        73.5, 260.7, 108.8, 120.8,  66.5,  59. , 188.5,  48.7, 164.9,
       160.4,  76.8, 170.7, 187. , 120. , 113.9,  83.1,  90.7, 166.3,
       135.4, 124.9, 120.6,  80.9,  55.7,  59.5, 127.5, 214.2, 128. ,
       240.4, 130.6, 137.9, 100.7, 135.8, 131.9,  72.9, 127.8,  60.1,
       116.3, 144.2, 128.8, 170.3, 138.6, 210.8, 200.8, 104.2,  42.7,
       280. , 140.1, 170.4, 255.2, 122.9,  96.7, 140.3, 155.2, 108.6,
       123.4, 120.9, 112.6, 137.4, 123.9,  90.4, 201.2, 138.8, 279.3,
       192.7, 256. , 115.2,  94.8, 304.8, 128.1, 330.8, 155.1, 128.3,
       150.1,  90.6,  30.1, 126.1, 150.2, 115.9, 208. ,  80.7, 436.5,
       124.1, 158.6, 112.2,  78.5,  54.6,  89.3, 139.7, 127.9, 143.9,
       172.6, 110.1, 200.6,  93.8, 105.5, 132.5,  96.5, 104. , 480.9,
       185. ,  84.4, 111.1,  56.2, 144.9, 159.4, 111.7, 112.9, 155.9,
       115.3, 125. , 132.7, 300.5, 376.4, 130.3,  67.5, 117. ,  98.2,
        71.9, 490.6, 160.3, 176.3,  71.3, 173.2,  46.1, 125.1, 160.9,
       126.5, 228.3, 308.2, 105.1, 130.7, 116.6, 165.3,  67.9, 100.4,
       236.3, 130.9,  95.8, 141.8, 134. ,  96. , 124.5, 570.1,  55.2,
       155.5, 380.7, 111.3, 110.3, 130.8,  71.4, 128.7, 296.1, 156.9,
       113.2, 132.1, 125.8, 185.3, 275.2, 100.3, 114. , 113.1, 135.2,
        71.7,  95.1, 109.3, 103.8,  45.3,  65.6, 103.6,  53.3, 152.1,
       360.3,  62.2, 160.6, 218.5, 110.5, 178.3,  60.5, 160.8, 239.8,
       138. , 110.4,  96.3, 121.6,  81.4, 133.9,  60.8, 150.6, 105.9,
       405.5, 144. , 100.6, 138.9, 187.1, 181. , 148.6, 152.7, 175.2,
        55.5, 151. , 190.6, 125.5,  60. , 149.5, 118.6, 136.5, 153.1,
       132.4, 141. ,  70.7, 162.4,  93.9, 162.7, 150.9, 230. , 132.9,
        87. , 154.1, 113.3, 128.6, 234.5, 246.4,  80.6, 500.9,  75.2,
        97. , 119.6, 105.2, 107.6, 209.5, 113.6, 208.8, 138.1, 243.4,
       480.7, 188.1,  40.7, 250.6, 148.3,  70.2, 311.3, 150.8, 124. ,
       185.4,  45.2, 480.8, 400.8, 161.8,  94.4, 130.1, 216.3, 196.2,
       126.7, 324.6, 107.1,  66.8, 157.1, 140.2,  99. ,  95.5, 128.9,
       102.9,  80.1, 145.5, 103.3, 159. , 181.4, 132. ,  26.5,  84.7,
       260.8, 162.8, 108.2, 600.4, 211.5, 258.4, 123.8,   9.2, 186.6,
       165.9, 275.3, 187.2, 108.3, 136.3, 107.4, 161.2, 205.4,  90.3,
        36.6,  61.4, 146.7, 172.3, 104.3,  71. ,  94.2, 106.8,  56.7,
       205.6, 292.1, 142. ,  89. , 192.9, 350.6, 128.5, 497. , 174. ,
       157.3, 253.4, 187.6, 133.2])